app/Controllers/LoginController.php

    public function auth(){
        $session = session();
        $model = new UserModel();

        /* Traemos los datos del formulario */
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $model->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'donpollox@pollo.com'
 LIMIT 1